Revit 2024 API
FabricationService.PaletteCount Property
 The number of palettes in the service.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public int PaletteCount { get; }
Visual Basic
Public ReadOnly Property PaletteCount As Integer
	Get
Visual C++
public:
property int PaletteCount {
	int get ();
}
See Also
FabricationService Class
Autodesk.Revit.DB Namespace